In [1]:
import pandas as pd

In [2]:
val = [10,20,30,40,50]
s= pd.Series(val, index=['a','b','c','d','e'])
s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [25]:
df= pd.DataFrame({
    'name': ['Mike','Bob','Alice'],
    'Age': [30,80,45],
    'Job':['Programming','Clerk','Designer']
})

In [26]:
df = df.set_index('name')
df.head()

       Age          Job
name
Mike    30  Programming
Bob     80        Clerk
Alice   45     Designer

In [27]:
df.loc['Mike']

Age             30
Job    Programming
Name: Mike, dtype: object

In [15]:
df

    name  Age          Job
0   Mike   30  Programming
1    Bob   80        Clerk
2  Alice   45     Designer

In [28]:
df.reset_index()

    name  Age          Job
0   Mike   30  Programming
1    Bob   80        Clerk
2  Alice   45     Designer

In [29]:
df.to_csv('mydata.csv')

In [36]:
pd.read_csv('mydata.csv',index_col=0)

       Age          Job
name
Mike    30  Programming
Bob     80        Clerk
Alice   45     Designer

In [37]:
df.to_json('mydata.json')

In [38]:
df.to_dict()

{'Age': {'Mike': 30, 'Bob': 80, 'Alice': 45},
 'Job': {'Mike': 'Programming', 'Bob': 'Clerk', 'Alice': 'Designer'}}